wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
/**
  ******************************************************************************
  * @file    fm33l0xx_atim.h
  * @author  FM33L0xx Application Team
  * @version V0.1.1
  * @date    6-Dec-2019
  * @brief   This file contains all the functions prototypes for the ATIM firmware library.  
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __FM33L0XX_ATIM_H
#define __FM33L0XX_ATIM_H


#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "FM33L0XX.h" 
#include "fm33l0xx_tim.h" 
//------------------------------------------------------------------------------

#define	ATIM_CR1_CKD_Pos	8	/* Dead time和数字滤波时钟频率分频寄存器 */
#define	ATIM_CR1_CKD_Msk	(0x3U << ATIM_CR1_CKD_Pos)
#define	ATIM_CR1_CKD_1TINT	(0x0U << ATIM_CR1_CKD_Pos)	/* 0：TCK */
#define	ATIM_CR1_CKD_2TINT	(0x1U << ATIM_CR1_CKD_Pos)	/* 1：2TCK */
#define	ATIM_CR1_CKD_4TINT	(0x2U << ATIM_CR1_CKD_Pos)	/* 2：4TCK */

#define	ATIM_CR1_ARPE_Pos	7	/* ARR预装载使能  */
#define	ATIM_CR1_ARPE_Msk	(0x1U << ATIM_CR1_ARPE_Pos)
	/* 0：ARR不使能预装载 */
	/* 1：ARR 使能预装载 */

#define	ATIM_CR1_CMS_Pos	5	/* 计数器对齐模式选择 */
#define	ATIM_CR1_CMS_Msk	(0x3U << ATIM_CR1_CMS_Pos)
#define	ATIM_CR1_CMS_SINGLE 	(0x0U << ATIM_CR1_CMS_Pos)	/* 00：边沿对齐模式 */
#define	ATIM_CR1_CMS_CENTRAL1	(0x1U << ATIM_CR1_CMS_Pos)	/* 01：中央对齐模式1，输出比较中断标志仅在计数器向下计数的过程中置位 */
#define	ATIM_CR1_CMS_CENTRAL2	(0x2U << ATIM_CR1_CMS_Pos)	/* 10：中央对齐模式2，输出比较中断标志仅在计数器向上计数的过程中置位 */
#define	ATIM_CR1_CMS_CENTRAL3	(0x3U << ATIM_CR1_CMS_Pos)	/* 11：中央对齐模式3，输出比较中断标志在计数器向上向下计数的过程中都会置位 */

#define	ATIM_CR1_DIR_Pos	4	/* 计数方向寄存器 */
#define	ATIM_CR1_DIR_Msk	(0x1U << ATIM_CR1_DIR_Pos)
#define	ATIM_CR1_DIR_UP	(0x0U << ATIM_CR1_DIR_Pos)	/* 0：向上计数 */
#define	ATIM_CR1_DIR_DOWN	(0x1U << ATIM_CR1_DIR_Pos)	/* 1：向下计数 */

#define	ATIM_CR1_OPM_Pos	3	/* 单脉冲输出模式 */
#define	ATIM_CR1_OPM_Msk	(0x1U << ATIM_CR1_OPM_Pos)
	/* 0：Update Event发生时计数器不停止 */
	/* 1：Update Event发生时计数器停止（自动清零CEN） */

#define	ATIM_CR1_URS_Pos	2	/* 更新请求选择 */
#define	ATIM_CR1_URS_Msk	(0x1U << ATIM_CR1_URS_Pos)
	/* 0：以下事件能够产生update中断或DMA请求
-计数器上溢出或下溢出
-软件置位UG寄存器
-从机控制器产生update */
	/* 1：仅计数器上溢出或下溢出会产生update中断或DMA请求 */

#define	ATIM_CR1_UDIS_Pos	1	/* 禁止update */
#define	ATIM_CR1_UDIS_Msk	(0x1U << ATIM_CR1_UDIS_Pos)
	/* 0：使能update事件；以下事件发生时产生update事件
-计数器上溢出或下溢出
-软件置位UG寄存器
-从机控制器产生update */
	/* 1：禁止update事件，不更新shadow寄存器。当UG置位或从机控制器收到硬件reset时重新初始化计数器和预分频器 */

#define	ATIM_CR1_CEN_Pos	0	/* 计数器使能 */
#define	ATIM_CR1_CEN_Msk	(0x1U << ATIM_CR1_CEN_Pos)
	/* 0：计数器关闭 */
	/* 1：计数器使能 */

#define	ATIM_CR2_OIS4_Pos	14	/* 参考OIS1 */
#define	ATIM_CR2_OIS4_Msk	(0x1U << ATIM_CR2_OIS4_Pos)

#define	ATIM_CR2_OIS3N_Pos	13	/* 参考OIS1N */
#define	ATIM_CR2_OIS3N_Msk	(0x1U << ATIM_CR2_OIS3N_Pos)

#define	ATIM_CR2_OIS3_Pos	12	/* 参考OIS1 */
#define	ATIM_CR2_OIS3_Msk	(0x1U << ATIM_CR2_OIS3_Pos)

#define	ATIM_CR2_OIS2N_Pos	11	/* 参考OIS1N */
#define	ATIM_CR2_OIS2N_Msk	(0x1U << ATIM_CR2_OIS2N_Pos)

#define	ATIM_CR2_OIS2_Pos	10	/* 参考OIS1 */
#define	ATIM_CR2_OIS2_Msk	(0x1U << ATIM_CR2_OIS2_Pos)

#define	ATIM_CR2_OIS1N_Pos	9	/* OC1N的输出IDLE状态 */
#define	ATIM_CR2_OIS1N_Msk	(0x1U << ATIM_CR2_OIS1N_Pos)
	/* 0：当MOE=0时，经过dead time后，OC1N=0 */
	/* 1：当MOE=0时，经过dead time后，OC1N=1 */

#define	ATIM_CR2_OIS1_Pos	8	/* OC1的输出IDLE状态 */
#define	ATIM_CR2_OIS1_Msk	(0x1U << ATIM_CR2_OIS1_Pos)
	/* 0：当MOE=0时（如果使能了互补输出，需经过dead time后），OC1=0 */
	/* 1：当MOE=0时（如果使能了互补输出，需经过dead time后），OC1=1 */

#define	ATIM_CR2_TI1S_Pos	7	/* ATIM输入TI1选择 */
#define	ATIM_CR2_TI1S_Msk	(0x1U << ATIM_CR2_TI1S_Pos)
#define	ATIM_CR2_TI1S_CH1	(0x0U << ATIM_CR2_TI1S_Pos)	/* 0：ATIM_CH1引脚连接到TI1输入 */
#define	ATIM_CR2_TI1S_XOR	(0x1U << ATIM_CR2_TI1S_Pos)	/* 1：ATIM_CH1、CH2、CH3引脚XOR后连接到TI1输入 */

#define	ATIM_CR2_MMS_Pos	4	/* 主机模式选择，用于配置主机模式下向从机发送的同步触发信号（TRGO）源 */
#define	ATIM_CR2_MMS_Msk	(0x7U << ATIM_CR2_MMS_Pos)
#define	ATIM_CR2_MMS_EGR	(0x0U << ATIM_CR2_MMS_Pos)	/* 000：ATIM_EGR的UG寄存器被用作TRGO */
#define	ATIM_CR2_MMS_CEN	(0x1U << ATIM_CR2_MMS_Pos)	/* 001：计数器使能信号CNT_EN被用作TRGO，可用于同时启动多个定时器 */
#define	ATIM_CR2_MMS_UE	(0x2U << ATIM_CR2_MMS_Pos)	/* 010：UE（update event）信号被用作TRGO */
#define	ATIM_CR2_MMS_COMP	(0x3U << ATIM_CR2_MMS_Pos)	/* 011：比较脉冲，如果CC1IF标志将要置位，TRGO输出一个正脉冲 */
#define	ATIM_CR2_MMS_OC1REF	(0x4U << ATIM_CR2_MMS_Pos)	/* 100：OC1REF用作TRGO */
#define	ATIM_CR2_MMS_OC2REF	(0x5U << ATIM_CR2_MMS_Pos)	/* 101：OC2REF用作TRGO */
#define	ATIM_CR2_MMS_OC3REF	(0x6U << ATIM_CR2_MMS_Pos)	/* 110：OC3REF用作TRGO */
#define	ATIM_CR2_MMS_OC4REF	(0x7U << ATIM_CR2_MMS_Pos)	/* 111：OC4REF用作TRGO */

#define	ATIM_CR2_CCDS_Pos	3	/* 捕捉/比较 DMA选择 */
#define	ATIM_CR2_CCDS_Msk	(0x1U << ATIM_CR2_CCDS_Pos)
#define	ATIM_CR2_CCDS_CC	(0x0U << ATIM_CR2_CCDS_Pos)	/* 0：捕捉/比较事件发生时发送DMA请求 */
#define	ATIM_CR2_CCDS_UE	(0x1U << ATIM_CR2_CCDS_Pos)	/* 1：Update Event发生时发送DMA请求 */

#define	ATIM_CR2_CCUS_Pos	2	/* 捕捉/比较控制寄存器更新选择 */
#define	ATIM_CR2_CCUS_Msk	(0x1U << ATIM_CR2_CCUS_Pos)
#define	ATIM_CR2_CCUS_COMG	(0x0U << ATIM_CR2_CCUS_Pos)	/* 0：当捕捉/比较控制寄存器使能了preload（CCPC=1），他们仅在置位COMG寄存器时更新 */
#define	ATIM_CR2_CCUS_COMG_TRGI	(0x1U << ATIM_CR2_CCUS_Pos)	/* 1：当捕捉/比较控制寄存器使能了preload（CCPC=1），他们在置位COMG寄存器或者TRGI上升沿时更新 */

#define	ATIM_CR2_CCPC_Pos	0
#define	ATIM_CR2_CCPC_Msk	(0x1U << ATIM_CR2_CCPC_Pos)
	/* 0：CCxE, CCxNE, OCxM寄存器不使能preload */

#define	ATIM_SMCR_ETP_Pos	15	/* 外部触发信号极性配置 */
#define	ATIM_SMCR_ETP_Msk	(0x1U << ATIM_SMCR_ETP_Pos)
#define	ATIM_SMCR_ETP_POS	(0x0U << ATIM_SMCR_ETP_Pos)	/* 0：高电平或上升沿有效 */
#define	ATIM_SMCR_ETP_NEG	(0x1U << ATIM_SMCR_ETP_Pos)	/* 1：低电平或下降沿有效 */

#define	ATIM_SMCR_ECE_Pos	14	/* 外部时钟使能 */
#define	ATIM_SMCR_ECE_Msk	(0x1U << ATIM_SMCR_ECE_Pos)
	/* 0：关闭外部时钟模式2 */
	/* 1：使能外部时钟模式2，计数器时钟为ETRF有效沿 */

#define	ATIM_SMCR_ETPS_Pos	12	/* 外部触发信号预分频寄存器,外部触发信号ETRP的频率最多只能是ATIM工作时钟的1/4，当输入信号频率较高时，可以使用预分频 */
#define	ATIM_SMCR_ETPS_Msk	(0x3U << ATIM_SMCR_ETPS_Pos)
#define	ATIM_SMCR_ETPS_DIV1	(0x0U << ATIM_SMCR_ETPS_Pos)	/* 00：不分频 */
#define	ATIM_SMCR_ETPS_DIV2	(0x1U << ATIM_SMCR_ETPS_Pos)	/* 01：2分频 */
#define	ATIM_SMCR_ETPS_DIV4	(0x2U << ATIM_SMCR_ETPS_Pos)	/* 10：4分频 */
#define	ATIM_SMCR_ETPS_DIV8	(0x3U << ATIM_SMCR_ETPS_Pos)	/* 11：8分频 */

#define	ATIM_SMCR_ETF_Pos	8	/* 外部触发信号滤波时钟和长度选择 */
#define	ATIM_SMCR_ETF_Msk	(0xfU << ATIM_SMCR_ETF_Pos)
#define	ATIM_SMCR_ETF_FILT0	(0x0U << ATIM_SMCR_ETF_Pos)	/* 0000：无滤波 */
#define	ATIM_SMCR_ETF_FILT1	(0x1U << ATIM_SMCR_ETF_Pos)	/* 0001：fSAMPLING=fCK_INT, N=2 */
#define	ATIM_SMCR_ETF_FILT2	(0x2U << ATIM_SMCR_ETF_Pos)	/* 0010：fSAMPLING=fCK_INT, N=4 */
#define	ATIM_SMCR_ETF_FILT3	(0x3U << ATIM_SMCR_ETF_Pos)	/* 0011：fSAMPLING=fCK_INT, N=8 */
#define	ATIM_SMCR_ETF_FILT4	(0x4U << ATIM_SMCR_ETF_Pos)	/* 0100：fSAMPLING=fDTS/2, N=6 */
#define	ATIM_SMCR_ETF_FILT5	(0x5U << ATIM_SMCR_ETF_Pos)	/* 0101：fSAMPLING=fDTS/2, N=8 */
#define	ATIM_SMCR_ETF_FILT6	(0x6U << ATIM_SMCR_ETF_Pos)	/* 0110：fSAMPLING=fDTS/4, N=6 */
#define	ATIM_SMCR_ETF_FILT7	(0x7U << ATIM_SMCR_ETF_Pos)	/* 0111：fSAMPLING=fDTS/4, N=8 */
#define	ATIM_SMCR_ETF_FILT8	(0x8U << ATIM_SMCR_ETF_Pos)	/* 1000：fSAMPLING=fDTS/8, N=6 */
#define	ATIM_SMCR_ETF_FILT9	(0x9U << ATIM_SMCR_ETF_Pos)	/* 1001：fSAMPLING=fDTS/8, N=8 */
#define	ATIM_SMCR_ETF_FILT10	(0xaU << ATIM_SMCR_ETF_Pos)	/* 1010：fSAMPLING=fDTS/16, N=5 */
#define	ATIM_SMCR_ETF_FILT11	(0xbU << ATIM_SMCR_ETF_Pos)	/* 1011：fSAMPLING=fDTS/16, N=6 */
#define	ATIM_SMCR_ETF_FILT12	(0xcU << ATIM_SMCR_ETF_Pos)	/* 1100：fSAMPLING=fDTS/16, N=8 */
#define	ATIM_SMCR_ETF_FILT13	(0xdU << ATIM_SMCR_ETF_Pos)	/* 1101：fSAMPLING=fDTS/32, N=5 */
#define	ATIM_SMCR_ETF_FILT14	(0xeU << ATIM_SMCR_ETF_Pos)	/* 1110：fSAMPLING=fDTS/32, N=6 */
#define	ATIM_SMCR_ETF_FILT15	(0xfU << ATIM_SMCR_ETF_Pos)	/* 1111：fSAMPLING=fDTS/32, N=8 */

