wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
#define	ATIM_ISR_CC4IF_Pos	4	/* 捕捉/比较通道4中断标志，参考CC1IF */
#define	ATIM_ISR_CC4IF_Msk	(0x1U << ATIM_ISR_CC4IF_Pos)

#define	ATIM_ISR_CC3IF_Pos	3	/* 捕捉/比较通道3中断标志，参考CC1IF */
#define	ATIM_ISR_CC3IF_Msk	(0x1U << ATIM_ISR_CC3IF_Pos)

#define	ATIM_ISR_CC2IF_Pos	2	/* 捕捉/比较通道2中断标志，参考CC1IF */
#define	ATIM_ISR_CC2IF_Msk	(0x1U << ATIM_ISR_CC2IF_Pos)

#define	ATIM_ISR_CC1IF_Pos	1	/* 捕捉/比较通道1中断标志，如果CC1通道配置为输出：CC1IF在计数值等于比较值时置位，软件写1清零。如果CC1通道配置为输入：发生捕捉事件时置位，软件写1清零，或者软件读ATIM_CCR1自动清零 */
#define	ATIM_ISR_CC1IF_Msk	(0x1U << ATIM_ISR_CC1IF_Pos)

#define	ATIM_ISR_UIF_Pos	0	/* 更新事件中断标志，硬件置位，软件写1清零 */
#define	ATIM_ISR_UIF_Msk	(0x1U << ATIM_ISR_UIF_Pos)

#define	ATIM_EGR_BG_Pos	7	/* 软件刹车，软件置位此寄存器产生刹车事件，硬件自动清零 */
#define	ATIM_EGR_BG_Msk	(0x1U << ATIM_EGR_BG_Pos)

#define	ATIM_EGR_TIF_Pos	6	/* 软件触发，软件置位此寄存器产生触发事件，硬件自动清零 */
#define	ATIM_EGR_TIF_Msk	(0x1U << ATIM_EGR_TIF_Pos)

#define	ATIM_EGR_COMG_Pos	5	/* 软件COM事件，硬件置位，软件写1清零 */
#define	ATIM_EGR_COMG_Msk	(0x1U << ATIM_EGR_COMG_Pos)

#define	ATIM_EGR_CC4G_Pos	4	/* 捕捉/比较通道4软件触发，参考CC1G */
#define	ATIM_EGR_CC4G_Msk	(0x1U << ATIM_EGR_CC4G_Pos)

#define	ATIM_EGR_CC3G_Pos	3	/* 捕捉/比较通道3软件触发，参考CC1G */
#define	ATIM_EGR_CC3G_Msk	(0x1U << ATIM_EGR_CC3G_Pos)

#define	ATIM_EGR_CC2G_Pos	2	/* 捕捉/比较通道2软件触发，参考CC1G */
#define	ATIM_EGR_CC2G_Msk	(0x1U << ATIM_EGR_CC2G_Pos)

#define	ATIM_EGR_CC1G_Pos	1	/* 捕捉/比较通道1软件触发 */
#define	ATIM_EGR_CC1G_Msk	(0x1U << ATIM_EGR_CC1G_Pos)

#define	ATIM_EGR_UG_Pos	0	/* 软件Update事件，软件置位此寄存器产生Update事件，硬件自动清零 */
#define	ATIM_EGR_UG_Msk	(0x1U << ATIM_EGR_UG_Pos)

#define	ATIM_CCMR1_OC2CE_Pos	15	/* 输出比较2清零使能，参考OC1CE */
#define	ATIM_CCMR1_OC2CE_Msk	(0x1U << ATIM_CCMR1_OC2CE_Pos)

#define	ATIM_CCMR1_OC2M_Pos	12	/* 输出比较2模式配置，参考OC1M */
#define	ATIM_CCMR1_OC2M_Msk	(0x7U << ATIM_CCMR1_OC2M_Pos)
#define	ATIM_CCMR1_OC2M_NONE	(0x0U << ATIM_CCMR1_OC1M_Pos)	/* 000：输出比较寄存器CCR1和计数器CNT的比较结果不会影响输出 */
#define	ATIM_CCMR1_OC2M_HIGH	(0x1U << ATIM_CCMR1_OC1M_Pos)	/* 001：CCR1=CNT时，将OC1REF置高 */
#define	ATIM_CCMR1_OC2M_LOW	(0x2U << ATIM_CCMR1_OC1M_Pos)	/* 010：CCR1=CNT时，将OC1REF置低 */
#define	ATIM_CCMR1_OC2M_TOG	(0x3U << ATIM_CCMR1_OC1M_Pos)	/* 011：CCR1=CNT时，翻转OC1REF */
#define	ATIM_CCMR1_OC2M_INACTIVE	(0x4U << ATIM_CCMR1_OC1M_Pos)	/* 100：OC1REF固定为低（inactive） */
#define	ATIM_CCMR1_OC2M_ACTIVE	(0x5U << ATIM_CCMR1_OC1M_Pos)	/* 101：OC1REF固定为高（active） */
#define	ATIM_CCMR1_OC2M_PWM1	(0x6U << ATIM_CCMR1_OC1M_Pos)	/* 110：PWM模式1 –在向上计数时，OC1REF在CNT<CCR1时置高，否则置低；在向下计数时，OC1REF在CNT>CCR1时置低，否则置高 */
#define	ATIM_CCMR1_OC2M_PWM2	(0x7U << ATIM_CCMR1_OC1M_Pos)	/* 111：PWM模式2 –在向上计数时，OC1REF在CNT<CCR1时置低，否则置高；在向下计数时，OC1REF在CNT>CCR1 时置高，否则置低 */

#define	ATIM_CCMR1_OC2PE_Pos	11	/* 输出比较2预装载使能，参考OC1PE */
#define	ATIM_CCMR1_OC2PE_Msk	(0x1U << ATIM_CCMR1_OC2PE_Pos)

#define	ATIM_CCMR1_OC2FE_Pos	10	/* 输出比较2快速使能，参考OC1FE */
#define	ATIM_CCMR1_OC2FE_Msk	(0x1U << ATIM_CCMR1_OC2FE_Pos)

#define	ATIM_CCMR1_CC2S_Pos	8	/* 捕捉/比较2通道选择 */
#define	ATIM_CCMR1_CC2S_Msk	(0x3U << ATIM_CCMR1_CC2S_Pos)
#define	ATIM_CCMR1_CC2S_OUT	(0x0U << ATIM_CCMR1_CC2S_Pos)	/* 00：CC2通道配置为输出 */
#define	ATIM_CCMR1_CC2S_TI2	(0x1U << ATIM_CCMR1_CC2S_Pos)	/* 01：CC2通道配置为输入，IC2映射到TI2 */
#define	ATIM_CCMR1_CC2S_TI1	(0x2U << ATIM_CCMR1_CC2S_Pos)	/* 10：CC2通道配置为输入，IC2映射到TI1 */
#define	ATIM_CCMR1_CC2S_TRC	(0x3U << ATIM_CCMR1_CC2S_Pos)	/* 11：CC2通道配置为输入，IC2映射到TRC */

#define	ATIM_CCMR1_OC1CE_Pos	7	/* 输出比较1清零使能 */
#define	ATIM_CCMR1_OC1CE_Msk	(0x1U << ATIM_CCMR1_OC1CE_Pos)
	/* 0：OC1REF不受ETRF影响 */
	/* 1：检测到ETRF高电平时，自动清零OC1REF */

#define	ATIM_CCMR1_OC1M_Pos	4	/* 输出比较1模式配置，此寄存器定义OC1REF信号的行为 */
#define	ATIM_CCMR1_OC1M_Msk	(0x7U << ATIM_CCMR1_OC1M_Pos)
#define	ATIM_CCMR1_OC1M_NONE	(0x0U << ATIM_CCMR1_OC1M_Pos)	/* 000：输出比较寄存器CCR1和计数器CNT的比较结果不会影响输出 */
#define	ATIM_CCMR1_OC1M_HIGH	(0x1U << ATIM_CCMR1_OC1M_Pos)	/* 001：CCR1=CNT时，将OC1REF置高 */
#define	ATIM_CCMR1_OC1M_LOW	(0x2U << ATIM_CCMR1_OC1M_Pos)	/* 010：CCR1=CNT时，将OC1REF置低 */
#define	ATIM_CCMR1_OC1M_TOG	(0x3U << ATIM_CCMR1_OC1M_Pos)	/* 011：CCR1=CNT时，翻转OC1REF */
#define	ATIM_CCMR1_OC1M_INACTIVE	(0x4U << ATIM_CCMR1_OC1M_Pos)	/* 100：OC1REF固定为低（inactive） */
#define	ATIM_CCMR1_OC1M_ACTIVE	(0x5U << ATIM_CCMR1_OC1M_Pos)	/* 101：OC1REF固定为高（active） */
#define	ATIM_CCMR1_OC1M_PWM1	(0x6U << ATIM_CCMR1_OC1M_Pos)	/* 110：PWM模式1 –在向上计数时，OC1REF在CNT<CCR1时置高，否则置低；在向下计数时，OC1REF在CNT>CCR1时置低，否则置高 */
#define	ATIM_CCMR1_OC1M_PWM2	(0x7U << ATIM_CCMR1_OC1M_Pos)	/* 111：PWM模式2 –在向上计数时，OC1REF在CNT<CCR1时置低，否则置高；在向下计数时，OC1REF在CNT>CCR1 时置高，否则置低 */

#define	ATIM_CCMR1_OC1PE_Pos	3	/* 输出比较1预装载使能 */
#define	ATIM_CCMR1_OC1PE_Msk	(0x1U << ATIM_CCMR1_OC1PE_Pos)
	/* 0：CCR1 preload寄存器无效，CCR1可以直接写入 */
	/* 1：CCR1 preload寄存器有效，针对CCR1的读写操作都是访问preload寄存器，当update event发生时才将preload寄存器的内容转移到shadow寄存器中 */

#define	ATIM_CCMR1_OC1FE_Pos	2	/* 输出比较1快速使能 */
#define	ATIM_CCMR1_OC1FE_Msk	(0x1U << ATIM_CCMR1_OC1FE_Pos)
	/* 0：关闭快速使能，trigger输入不会影响比较输出 */
	/* 1：打开快速使能，trigger输入会立即将OC1REF改变为比较值匹配时的输出，而不管当前实际比较情况（只用于触发模式） */

#define	ATIM_CCMR1_CC1S_Pos	0	/* 捕捉/比较1通道选择 */
#define	ATIM_CCMR1_CC1S_Msk	(0x3U << ATIM_CCMR1_CC1S_Pos)
#define	ATIM_CCMR1_CC1S_OUT	(0x0U << ATIM_CCMR1_CC1S_Pos)	/* 00：CC1通道配置为输出 */
#define	ATIM_CCMR1_CC1S_TI1	(0x1U << ATIM_CCMR1_CC1S_Pos)	/* 01：CC1通道配置为输入，IC1映射到TI1 */
#define	ATIM_CCMR1_CC1S_TI2	(0x2U << ATIM_CCMR1_CC1S_Pos)	/* 10：CC1通道配置为输入，IC1映射到TI2 */
#define	ATIM_CCMR1_CC1S_TRC	(0x3U << ATIM_CCMR1_CC1S_Pos)	/* 11：CC1通道配置为输入，IC1映射到TRC */

#define	ATIM_CCMR1_IC2F_Pos	12	/* 输入捕捉2滤波 */
#define	ATIM_CCMR1_IC2F_Msk	(0xfU << ATIM_CCMR1_IC2F_Pos)

#define	ATIM_CCMR1_IC2PSC_Pos	10	/* 输入捕捉2预分频 */
#define	ATIM_CCMR1_IC2PSC_Msk	(0x3U << ATIM_CCMR1_IC2PSC_Pos)

#define	ATIM_CCMR1_IC1F_Pos	4	/* 输入捕捉1滤波 */
#define	ATIM_CCMR1_IC1F_Msk	(0xfU << ATIM_CCMR1_IC1F_Pos)
#define	ATIM_CCMR1_IC1F_FILT0	(0x0U << ATIM_CCMR1_IC1F_Pos)	/* 0000：无滤波，使用fDTS采样 */
#define	ATIM_CCMR1_IC1F_FILT1	(0x1U << ATIM_CCMR1_IC1F_Pos)	/* 0001：fSAMPLING=fCK_INT, N=2 */
#define	ATIM_CCMR1_IC1F_FILT2	(0x2U << ATIM_CCMR1_IC1F_Pos)	/* 0010：fSAMPLING=fCK_INT, N=4 */
#define	ATIM_CCMR1_IC1F_FILT3	(0x3U << ATIM_CCMR1_IC1F_Pos)	/* 0011：fSAMPLING=fCK_INT, N=8 */
#define	ATIM_CCMR1_IC1F_FILT4	(0x4U << ATIM_CCMR1_IC1F_Pos)	/* 0100：fSAMPLING=fDTS/2, N=6 */
#define	ATIM_CCMR1_IC1F_FILT5	(0x5U << ATIM_CCMR1_IC1F_Pos)	/* 0101：fSAMPLING=fDTS/2, N=8 */
#define	ATIM_CCMR1_IC1F_FILT6	(0x6U << ATIM_CCMR1_IC1F_Pos)	/* 0110：fSAMPLING=fDTS/4, N=6 */
#define	ATIM_CCMR1_IC1F_FILT7	(0x7U << ATIM_CCMR1_IC1F_Pos)	/* 0111：fSAMPLING=fDTS/4, N=8 */
#define	ATIM_CCMR1_IC1F_FILT8	(0x8U << ATIM_CCMR1_IC1F_Pos)	/* 1000：fSAMPLING=fDTS/8, N=6 */
#define	ATIM_CCMR1_IC1F_FILT9	(0x9U << ATIM_CCMR1_IC1F_Pos)	/* 1001：fSAMPLING=fDTS/8, N=8 */
#define	ATIM_CCMR1_IC1F_FILT10	(0xaU << ATIM_CCMR1_IC1F_Pos)	/* 1010：fSAMPLING=fDTS/16, N=5 */
#define	ATIM_CCMR1_IC1F_FILT11	(0xbU << ATIM_CCMR1_IC1F_Pos)	/* 1011：fSAMPLING=fDTS/16, N=6 */
#define	ATIM_CCMR1_IC1F_FILT12	(0xcU << ATIM_CCMR1_IC1F_Pos)	/* 1100：fSAMPLING=fDTS/16, N=8 */
#define	ATIM_CCMR1_IC1F_FILT13	(0xdU << ATIM_CCMR1_IC1F_Pos)	/* 1101：fSAMPLING=fDTS/32, N=5 */
#define	ATIM_CCMR1_IC1F_FILT14	(0xeU << ATIM_CCMR1_IC1F_Pos)	/* 1110：fSAMPLING=fDTS/32, N=6 */
#define	ATIM_CCMR1_IC1F_FILT15	(0xfU << ATIM_CCMR1_IC1F_Pos)	/* 1111：fSAMPLING=fDTS/32, N=8 */

#define	ATIM_CCMR1_IC1PSC_Pos	2	/* 输入捕捉1预分频 */
#define	ATIM_CCMR1_IC1PSC_Msk	(0x3U << ATIM_CCMR1_IC1PSC_Pos)
#define	ATIM_CCMR1_IC1PSC_DIV1	(0x0U << ATIM_CCMR1_IC1PSC_Pos)	/* 00：无分频 */
#define	ATIM_CCMR1_IC1PSC_DIV2	(0x1U << ATIM_CCMR1_IC1PSC_Pos)	/* 01：每2个事件输入产生一次捕捉 */
#define	ATIM_CCMR1_IC1PSC_DIV4	(0x2U << ATIM_CCMR1_IC1PSC_Pos)	/* 10：每4个事件输入产生一次捕捉 */
#define	ATIM_CCMR1_IC1PSC_DIV8	(0x3U << ATIM_CCMR1_IC1PSC_Pos)	/* 11：每8个事件输入产生一次捕捉 */


