wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
#define	ATIM_CCMR2_OC4CE_Pos	15	/* 输出比较4清零使能，参考OC1CE */
#define	ATIM_CCMR2_OC4CE_Msk	(0x1U << ATIM_CCMR2_OC4CE_Pos)

#define	ATIM_CCMR2_OC4M_Pos	12
#define	ATIM_CCMR2_OC4M_Msk	(0x7U << ATIM_CCMR2_OC4M_Pos)
#define	ATIM_CCMR1_OC4M_NONE	(0x0U << ATIM_CCMR1_OC1M_Pos)	/* 000：输出比较寄存器CCR1和计数器CNT的比较结果不会影响输出 */
#define	ATIM_CCMR1_OC4M_HIGH	(0x1U << ATIM_CCMR1_OC1M_Pos)	/* 001：CCR1=CNT时，将OC1REF置高 */
#define	ATIM_CCMR1_OC4M_LOW	(0x2U << ATIM_CCMR1_OC1M_Pos)	/* 010：CCR1=CNT时，将OC1REF置低 */
#define	ATIM_CCMR1_OC4M_TOG	(0x3U << ATIM_CCMR1_OC1M_Pos)	/* 011：CCR1=CNT时，翻转OC1REF */
#define	ATIM_CCMR1_OC4M_INACTIVE	(0x4U << ATIM_CCMR1_OC1M_Pos)	/* 100：OC1REF固定为低（inactive） */
#define	ATIM_CCMR1_OC4M_ACTIVE	(0x5U << ATIM_CCMR1_OC1M_Pos)	/* 101：OC1REF固定为高（active） */
#define	ATIM_CCMR1_OC4M_PWM1	(0x6U << ATIM_CCMR1_OC1M_Pos)	/* 110：PWM模式1 –在向上计数时，OC1REF在CNT<CCR1时置高，否则置低；在向下计数时，OC1REF在CNT>CCR1时置低，否则置高 */
#define	ATIM_CCMR1_OC4M_PWM2	(0x7U << ATIM_CCMR1_OC1M_Pos)	/* 111：PWM模式2 –在向上计数时，OC1REF在CNT<CCR1时置低，否则置高；在向下计数时，OC1REF在CNT>CCR1 时置高，否则置低 */

#define	ATIM_CCMR2_OC4PE_Pos	11	/* 输出比较4预装载使能，参考OC1PE */
#define	ATIM_CCMR2_OC4PE_Msk	(0x1U << ATIM_CCMR2_OC4PE_Pos)

#define	ATIM_CCMR2_OC4FE_Pos	10	/* 输出比较4快速使能，参考OC1FE */
#define	ATIM_CCMR2_OC4FE_Msk	(0x1U << ATIM_CCMR2_OC4FE_Pos)

#define	ATIM_CCMR2_CC4S_Pos	8	/* 捕捉/比较4通道选择 */
#define	ATIM_CCMR2_CC4S_Msk	(0x3U << ATIM_CCMR2_CC4S_Pos)
#define	ATIM_CCMR2_CC4S_OUT	(0x0U << ATIM_CCMR2_CC4S_Pos)	/* 00：CC4通道配置为输出 */
#define	ATIM_CCMR2_CC4S_TI4	(0x1U << ATIM_CCMR2_CC4S_Pos)	/* 01：CC4通道配置为输入，IC4映射到TI4 */
#define	ATIM_CCMR2_CC4S_TI3	(0x2U << ATIM_CCMR2_CC4S_Pos)	/* 10：CC4通道配置为输入，IC4映射到TI3 */
#define	ATIM_CCMR2_CC4S_TRC	(0x3U << ATIM_CCMR2_CC4S_Pos)	/* 11：CC4通道配置为输入，IC4映射到TRC */

#define	ATIM_CCMR2_OC3CE_Pos	7	/* 输出比较1清零使能 */
#define	ATIM_CCMR2_OC3CE_Msk	(0x1U << ATIM_CCMR2_OC3CE_Pos)
	/* 0：OC1REF不受ETRF影响 */
	/* 1：检测到ETRF高电平时，自动清零OC1REF */

#define	ATIM_CCMR2_OC3M_Pos	4	/* 输出比较3模式配置，此寄存器定义OC3REF信号的行为 */
#define	ATIM_CCMR2_OC3M_Msk	(0x7U << ATIM_CCMR2_OC3M_Pos)
#define	ATIM_CCMR2_OC3M_NONE	(0x0U << ATIM_CCMR2_OC3M_Pos)	/* 000：输出比较寄存器CCR3和计数器CNT的比较结果不会影响输出 */
#define	ATIM_CCMR2_OC3M_HIGH	(0x1U << ATIM_CCMR2_OC3M_Pos)	/* 001：CCR3=CNT时，将OC1REF置高 */
#define	ATIM_CCMR2_OC3M_LOW	(0x2U << ATIM_CCMR2_OC3M_Pos)	/* 010：CCR3=CNT时，将OC1REF置低 */
#define	ATIM_CCMR2_OC3M_TOG	(0x3U << ATIM_CCMR2_OC3M_Pos)	/* 011：CCR3=CNT时，翻转OC1REF */
#define	ATIM_CCMR2_OC3M_INACTIVE	(0x4U << ATIM_CCMR2_OC3M_Pos)	/* 100：OC3REF固定为低（inactive） */
#define	ATIM_CCMR2_OC3M_ACTIVE	(0x5U << ATIM_CCMR2_OC3M_Pos)	/* 101：OC3REF固定为高（active） */
#define	ATIM_CCMR2_OC3M_PWM1	(0x6U << ATIM_CCMR2_OC3M_Pos)	/* 110：PWM模式1 –在向上计数时，OC3REF在CNT<CCR3时置高，否则置低；在向下计数时，OC3REF在CNT>CCR3时置低，否则置高 */
#define	ATIM_CCMR2_OC3M_PWM2	(0x7U << ATIM_CCMR2_OC3M_Pos)	/* 111：PWM模式2 –在向上计数时，OC3REF在CNT<CCR3时置低，否则置高；在向下计数时，OC3REF在CNT>CCR3 时置高，否则置低 */

#define	ATIM_CCMR2_OC3PE_Pos	3	/* 输出比较3预装载使能 */
#define	ATIM_CCMR2_OC3PE_Msk	(0x1U << ATIM_CCMR2_OC3PE_Pos)
	/* 0：CCR3 preload寄存器无效，CCR3可以直接写入 */
	/* 1：CCR3 preload寄存器有效，针对CCR3的读写操作都是访问preload寄存器，当update event发生时才将preload寄存器的内容转移到shadow寄存器中 */

#define	ATIM_CCMR2_OC3FE_Pos	2	/* 输出比较3快速使能 */
#define	ATIM_CCMR2_OC3FE_Msk	(0x1U << ATIM_CCMR2_OC3FE_Pos)
	/* 0：关闭快速使能，trigger输入不会影响比较输出 */
	/* 1：打开快速使能，trigger输入会立即将OC3REF改变为比较值匹配时的输出，而不管当前实际比较情况 */

#define	ATIM_CCMR2_CC3S_Pos	0	/* 捕捉/比较3通道选择 */
#define	ATIM_CCMR2_CC3S_Msk	(0x3U << ATIM_CCMR2_CC3S_Pos)
#define	ATIM_CCMR2_CC3S_OUT	(0x0U << ATIM_CCMR2_CC3S_Pos)	/* 00：CC3通道配置为输出 */
#define	ATIM_CCMR2_CC3S_TI3	(0x1U << ATIM_CCMR2_CC3S_Pos)	/* 01：CC3通道配置为输入，IC1映射到TI3 */
#define	ATIM_CCMR2_CC3S_TI4	(0x2U << ATIM_CCMR2_CC3S_Pos)	/* 10：CC3通道配置为输入，IC1映射到TI4 */
#define	ATIM_CCMR2_CC3S_TRC	(0x3U << ATIM_CCMR2_CC3S_Pos)	/* 11：CC3通道配置为输入，IC1映射到TRC */

#define	ATIM_CCMR2_IC4F_Pos	12	/* 输入捕捉4滤波 */
#define	ATIM_CCMR2_IC4F_Msk	(0xfU << ATIM_CCMR2_IC4F_Pos)

#define	ATIM_CCMR2_IC4PSC_Pos	10	/* 输入捕捉4预分频 */
#define	ATIM_CCMR2_IC4PSC_Msk	(0x3U << ATIM_CCMR2_IC4PSC_Pos)

#define	ATIM_CCMR2_IC3F_Pos	4	/* 输入捕捉3滤波 */
#define	ATIM_CCMR2_IC3F_Msk	(0xfU << ATIM_CCMR2_IC3F_Pos)
#define	ATIM_CCMR2_IC3F_FILT0	(0x0U << ATIM_CCMR2_IC3F_Pos)	/* 0000：无滤波，使用fDTS采样 */
#define	ATIM_CCMR2_IC3F_FILT1	(0x1U << ATIM_CCMR2_IC3F_Pos)	/* 0001：fSAMPLING=fCK_INT, N=2 */
#define	ATIM_CCMR2_IC3F_FILT2	(0x2U << ATIM_CCMR2_IC3F_Pos)	/* 0010：fSAMPLING=fCK_INT, N=4 */
#define	ATIM_CCMR2_IC3F_FILT3	(0x3U << ATIM_CCMR2_IC3F_Pos)	/* 0011：fSAMPLING=fCK_INT, N=8 */
#define	ATIM_CCMR2_IC3F_FILT4	(0x4U << ATIM_CCMR2_IC3F_Pos)	/* 0100：fSAMPLING=fDTS/2, N=6 */
#define	ATIM_CCMR2_IC3F_FILT5	(0x5U << ATIM_CCMR2_IC3F_Pos)	/* 0101：fSAMPLING=fDTS/2, N=8 */
#define	ATIM_CCMR2_IC3F_FILT6	(0x6U << ATIM_CCMR2_IC3F_Pos)	/* 0110：fSAMPLING=fDTS/4, N=6 */
#define	ATIM_CCMR2_IC3F_FILT7	(0x7U << ATIM_CCMR2_IC3F_Pos)	/* 0111：fSAMPLING=fDTS/4, N=8 */
#define	ATIM_CCMR2_IC3F_FILT8	(0x8U << ATIM_CCMR2_IC3F_Pos)	/* 1000：fSAMPLING=fDTS/8, N=6 */
#define	ATIM_CCMR2_IC3F_FILT9	(0x9U << ATIM_CCMR2_IC3F_Pos)	/* 1001：fSAMPLING=fDTS/8, N=8 */
#define	ATIM_CCMR2_IC3F_FILT10	(0xaU << ATIM_CCMR2_IC3F_Pos)	/* 1010：fSAMPLING=fDTS/16, N=5 */
#define	ATIM_CCMR2_IC3F_FILT11	(0xbU << ATIM_CCMR2_IC3F_Pos)	/* 1011：fSAMPLING=fDTS/16, N=6 */
#define	ATIM_CCMR2_IC3F_FILT12	(0xcU << ATIM_CCMR2_IC3F_Pos)	/* 1100：fSAMPLING=fDTS/16, N=8 */
#define	ATIM_CCMR2_IC3F_FILT13	(0xdU << ATIM_CCMR2_IC3F_Pos)	/* 1101：fSAMPLING=fDTS/32, N=5 */
#define	ATIM_CCMR2_IC3F_FILT14	(0xeU << ATIM_CCMR2_IC3F_Pos)	/* 1110：fSAMPLING=fDTS/32, N=6 */
#define	ATIM_CCMR2_IC3F_FILT15	(0xfU << ATIM_CCMR2_IC3F_Pos)	/* 1111：fSAMPLING=fDTS/32, N=8 */

#define	ATIM_CCMR2_IC3PSC_Pos	2	/* 输入捕捉3预分频 */
#define	ATIM_CCMR2_IC3PSC_Msk	(0x3U << ATIM_CCMR2_IC3PSC_Pos)
#define	ATIM_CCMR2_IC3PSC_DIV1	(0x0U << ATIM_CCMR2_IC3PSC_Pos)	/* 00：无分频 */
#define	ATIM_CCMR2_IC3PSC_DIV2	(0x1U << ATIM_CCMR2_IC3PSC_Pos)	/* 01：每2个事件输入产生一次捕捉 */
#define	ATIM_CCMR2_IC3PSC_DIV4	(0x2U << ATIM_CCMR2_IC3PSC_Pos)	/* 10：每4个事件输入产生一次捕捉 */
#define	ATIM_CCMR2_IC3PSC_DIV8	(0x3U << ATIM_CCMR2_IC3PSC_Pos)	/* 11：每8个事件输入产生一次捕捉 */

