wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
#define	ATIM_CCER_CC4P_Pos	13	/* 捕捉/比较4输出极性，参考CC1P */
#define	ATIM_CCER_CC4P_Msk	(0x1U << ATIM_CCER_CC4P_Pos)
#define	ATIM_CCER_CC4P_HIGH	(0x0U << ATIM_CCER_CC4P_Pos)
#define	ATIM_CCER_CC4P_LOW	(0x1U << ATIM_CCER_CC4P_Pos)

#define	ATIM_CCER_CC4E_Pos	12	/* 捕捉/比较4输出使能，参考CC1E */
#define	ATIM_CCER_CC4E_Msk	(0x1U << ATIM_CCER_CC4E_Pos)

#define	ATIM_CCER_CC3NP_Pos	11	/* 捕捉/比较3互补输出极性，参考CC1NP */
#define	ATIM_CCER_CC3NP_Msk	(0x1U << ATIM_CCER_CC3NP_Pos)
#define	ATIM_CCER_CC3NP_HIGH	(0x0U << ATIM_CCER_CC3NP_Pos)
#define	ATIM_CCER_CC3NP_LOW	(0x1U << ATIM_CCER_CC3NP_Pos)

#define	ATIM_CCER_CC3NE_Pos	10	/* 捕捉/比较3互补输出使能，参考CC1NE */
#define	ATIM_CCER_CC3NE_Msk	(0x1U << ATIM_CCER_CC3NE_Pos)

#define	ATIM_CCER_CC3P_Pos	9	/* 捕捉/比较3输出极性，参考CC1P */
#define	ATIM_CCER_CC3P_Msk	(0x1U << ATIM_CCER_CC3P_Pos)
#define	ATIM_CCER_CC3P_HIGH	(0x0U << ATIM_CCER_CC3P_Pos)
#define	ATIM_CCER_CC3P_LOW	(0x1U << ATIM_CCER_CC3P_Pos)

#define	ATIM_CCER_CC3E_Pos	8	/* 捕捉/比较3输出使能，参考CC1E */
#define	ATIM_CCER_CC3E_Msk	(0x1U << ATIM_CCER_CC3E_Pos)

#define	ATIM_CCER_CC2NP_Pos	7	/* 捕捉/比较2互补输出极性，参考CC1NP */
#define	ATIM_CCER_CC2NP_Msk	(0x1U << ATIM_CCER_CC2NP_Pos)
#define	ATIM_CCER_CC2NP_HIGH	(0x0U << ATIM_CCER_CC2NP_Pos)
#define	ATIM_CCER_CC2NP_LOW	(0x1U << ATIM_CCER_CC2NP_Pos)

#define	ATIM_CCER_CC2NE_Pos	6	/* 捕捉/比较2互补输出使能，参考CC1NE */
#define	ATIM_CCER_CC2NE_Msk	(0x1U << ATIM_CCER_CC2NE_Pos)

#define	ATIM_CCER_CC2P_Pos	5	/* 捕捉/比较2输出极性，参考CC1P */
#define	ATIM_CCER_CC2P_Msk	(0x1U << ATIM_CCER_CC2P_Pos)
#define	ATIM_CCER_CC2P_HIGH	(0x0U << ATIM_CCER_CC2P_Pos)
#define	ATIM_CCER_CC2P_LOW	(0x1U << ATIM_CCER_CC2P_Pos)

#define	ATIM_CCER_CC2E_Pos	4	/* 捕捉/比较2输出使能，参考CC1E */
#define	ATIM_CCER_CC2E_Msk	(0x1U << ATIM_CCER_CC2E_Pos)

#define	ATIM_CCER_CC1NP_Pos	3	/* 捕捉/比较1互补输出极性 */
#define	ATIM_CCER_CC1NP_Msk	(0x1U << ATIM_CCER_CC1NP_Pos)
#define	ATIM_CCER_CC1NP_HIGH	(0x0U << ATIM_CCER_CC1NP_Pos)	/* 0：OC1N高电平为active */
#define	ATIM_CCER_CC1NP_LOW	(0x1U << ATIM_CCER_CC1NP_Pos)	/* 1：OC1N低电平为active */

#define	ATIM_CCER_CC1NE_Pos	2	/* 捕捉/比较1互补输出使能 */
#define	ATIM_CCER_CC1NE_Msk	(0x1U << ATIM_CCER_CC1NE_Pos)
	/* 0：OC1N无效，OC1N电平由MOE, OSSI, OSSR, OIS1, OIS1N, CC1E寄存器决定 */

#define	ATIM_CCER_CC1P_Pos	1	/* 捕捉/比较1输出极性 (CC1 Polarity)
CC1通道配置为输出时
0：OC1高电平active
1：OC1低电平active
CC1通道配置为输入时
0：非取反模式–捕捉在IC1的上升沿进行
1：取反模式–捕捉在IC1的下降沿进行 */
#define	ATIM_CCER_CC1P_Msk	(0x1U << ATIM_CCER_CC1P_Pos)
#define	ATIM_CCER_CC1P_HIGH	(0x0U << ATIM_CCER_CC1P_Pos)
#define	ATIM_CCER_CC1P_LOW	(0x1U << ATIM_CCER_CC1P_Pos)

#define	ATIM_CCER_CC1E_Pos	0	/* 捕捉/比较1输出使能 (CC1 Enable)
CC1通道配置为输出时
0：OC1不active
1：OC1 active
CC1通道配置为输入时
0：关闭捕捉功能
1：使能捕捉功能 */
#define	ATIM_CCER_CC1E_Msk	(0x1U << ATIM_CCER_CC1E_Pos)


#define	ATIM_CNT_CNT_Pos	0	/* 计数器值 */
#define	ATIM_CNT_CNT_Msk	(0xffffU << ATIM_CNT_CNT_Pos)

#define	ATIM_PSC_PSC_Pos	0	/* 计数器时钟预分频值
fCK_CNT=fCK_PSC/(PSC[15:0]+1)
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 */
#define	ATIM_PSC_PSC_Msk	(0xffffU << ATIM_PSC_PSC_Pos)

#define	ATIM_ARR_ARR_Pos	0	/* 计数溢出时的自动重载值 
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 */
#define	ATIM_ARR_ARR_Msk	(0xffffU << ATIM_ARR_ARR_Pos)

#define	ATIM_RCR_REP_Pos	0	/* 重复计数值  */
#define	ATIM_RCR_REP_Msk	(0xffU << ATIM_RCR_REP_Pos)

#define	ATIM_CCR1_CCR1_Pos	0	/* 捕捉/比较通道1寄存器 
如果通道1配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC1输出
如果通道1配置为输入：
CCR1保存最近一次输入捕捉事件发生时的计数器值，此时CCR1为只读 */
#define	ATIM_CCR1_CCR1_Msk	(0xffffU << ATIM_CCR1_CCR1_Pos)

#define	ATIM_CCR2_CCR2_Pos	0	/* 捕捉/比较通道2寄存器 
如果通道2配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC2输出
如果通道2配置为输入：
CCR2保存最近一次输入捕捉事件发生时的计数器值，此时CCR2为只读 */
#define	ATIM_CCR2_CCR2_Msk	(0xffffU << ATIM_CCR2_CCR2_Pos)

#define	ATIM_CCR3_CCR3_Pos	0	/* 捕捉/比较通道3寄存器 
如果通道3配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC3输出
如果通道3配置为输入：
CCR3保存最近一次输入捕捉事件发生时的计数器值，此时CCR3为只读 */
#define	ATIM_CCR3_CCR3_Msk	(0xffffU << ATIM_CCR3_CCR3_Pos)

#define	ATIM_CCR4_CCR4_Pos	0	/* 捕捉/比较通道4寄存器 
如果通道4配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC4输出
如果通道4配置为输入：
CCR4保存最近一次输入捕捉事件发生时的计数器值，此时CCR4为只读 */
#define	ATIM_CCR4_CCR4_Msk	(0xffffU << ATIM_CCR4_CCR4_Pos)

#define	ATIM_BDTR_MOE_Pos	15	/* 输出使能主控 */
#define	ATIM_BDTR_MOE_Msk	(0x1U << ATIM_BDTR_MOE_Pos)
	/* 0：关闭OC和OCN输出，具体IO输出状态由OSSI决定 */
	/* 1：使能OC和OCN输出 */

#define	ATIM_BDTR_AOE_Pos	14	/* 自动输出使能 */
#define	ATIM_BDTR_AOE_Msk	(0x1U << ATIM_BDTR_AOE_Pos)
#define	ATIM_BDTR_AOE_SOFT	     (0x0U << ATIM_BDTR_AOE_Pos)	/* 0：MOE仅能由软件置位 */
#define	ATIM_BDTR_AOE_SOFTAEVENT (0x1U << ATIM_BDTR_AOE_Pos)	/* 1：MOE可以软件置位，或者由update事件自动置位 */

#define	ATIM_BDTR_BKP_Pos	13
#define	ATIM_BDTR_BKP_Msk	(0x1U << ATIM_BDTR_BKP_Pos)
#define	ATIM_BDTR_BKP_LOW	(0x0U << ATIM_BDTR_BKP_Pos)
#define	ATIM_BDTR_BKP_HIGH	(0x1U << ATIM_BDTR_BKP_Pos)

#define	ATIM_BDTR_BKE_Pos	12
#define	ATIM_BDTR_BKE_Msk	(0x1U << ATIM_BDTR_BKE_Pos)

#define	ATIM_BDTR_OSSR_Pos	11
#define	ATIM_BDTR_OSSR_Msk	(0x1U << ATIM_BDTR_OSSR_Pos)
#define	ATIM_BDTR_OSSR_NO_GPIO	(0x0U << ATIM_BDTR_OSSR_Pos)
#define	ATIM_BDTR_OSSR_GPIO	(0x1U << ATIM_BDTR_OSSR_Pos)

#define	ATIM_BDTR_OSSI_Pos	10
#define	ATIM_BDTR_OSSI_Msk	(0x1U << ATIM_BDTR_OSSI_Pos)
#define	ATIM_BDTR_OSSI_NO_GPIO	(0x0U << ATIM_BDTR_OSSI_Pos)
#define	ATIM_BDTR_OSSI_GPIO	(0x1U << ATIM_BDTR_OSSI_Pos)

#define	ATIM_BDTR_LOCK_Pos	8	/* 寄存器写保护配置 */
#define	ATIM_BDTR_LOCK_Msk	(0x3U << ATIM_BDTR_LOCK_Pos)
#define	ATIM_BDTR_LOCK_NONE	(0x0U << ATIM_BDTR_LOCK_Pos)	/* 00：无写保护 */
#define	ATIM_BDTR_LOCK_PROTECT1	(0x1U << ATIM_BDTR_LOCK_Pos)	/* 01：保护等级1 – DTG, OISx, OISxN, BKE, BKP, AOE不能改写 */
#define	ATIM_BDTR_LOCK_PROTECT2	(0x2U << ATIM_BDTR_LOCK_Pos)	/* 10：保护等级2 –在等级1基础上，CCxP, CCxNP, OSSR, OSSI不能改写 */
#define	ATIM_BDTR_LOCK_PROTECT3	(0x3U << ATIM_BDTR_LOCK_Pos)	/* 11：保护等级3 –在等级2基础上，OCxM, OcxPE在相应通道配置为输出时不能改写 */

#define	ATIM_BDTR_DTG_Pos	0	/* 死区时间插入，用于配置互补输出插入的死区时间长度 */
#define	ATIM_BDTR_DTG_Msk	(0xffU << ATIM_BDTR_DTG_Pos)
#define	ATIM_BDTR_DTG_N_DTG	(0x0U << ATIM_BDTR_DTG_Pos)	/* DTG[7:5]=0xx：DT=DTG[7:0] * tDTS */
#define	ATIM_BDTR_DTG_64_DTG_2T	(0x4U << ATIM_BDTR_DTG_Pos)	/* DTG[7:5]=10x：DT=(64+DTG[5:0]) * 2 * tDTS */
#define	ATIM_BDTR_DTG_32_DTG_8T	(0x6U << ATIM_BDTR_DTG_Pos)	/* DTG[7:5]=110：DT=(32+DTG[4:0]) * 8 * tDTS */
#define	ATIM_BDTR_DTG_32_DTG_16T	(0x7U << ATIM_BDTR_DTG_Pos)	/* DTG[7:5]=111：DT=(32+DTG[4:0]) * 16 * tDTS */

#define	ATIM_DCR_DBL_Pos	8	/* DMA Burst长度 */
#define	ATIM_DCR_DBL_Msk	(0x1fU << ATIM_DCR_DBL_Pos)

#define	ATIM_DCR_DBA_Pos	0	/* DMA基地址，定义指向寄存器的偏移地址 */
#define	ATIM_DCR_DBA_Msk	(0x1fU << ATIM_DCR_DBA_Pos)
#define	ATIM_DCR_DBA_ATIM_CR1	(0x0U << ATIM_DCR_DBA_Pos)	/* 00000：ATIM_CR1 */
#define	ATIM_DCR_DBA_ATIM_CR2	(0x1U << ATIM_DCR_DBA_Pos)	/* 00001：ATIM_CR2 */
#define	ATIM_DCR_DBA_ATIM_SMCR	(0x2U << ATIM_DCR_DBA_Pos)	/* 00010：ATIM_SMCR */

#define	ATIM_DMAR_DMAR_Pos	0	/* DMA burst访问寄存器
在使用DMA burst传输时，将DMA通道外设地址设置为ATIM_DMAR，ATIM会根据DBL的值产生多次DMA请求 */
#define	ATIM_DMAR_DMAR_Msk	(0xffffffffU << ATIM_DMAR_DMAR_Pos)

