wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
#define	ATIM_BKCR_BRK2GATE_Pos	9	/* ATIM_BRK2引脚输入门控信号 */
#define	ATIM_BKCR_BRK2GATE_Msk	(0x1U << ATIM_BKCR_BRK2GATE_Pos)
#define	ATIM_BKCR_BRK2GATE_ZERO	(0x0U << ATIM_BKCR_BRK2GATE_Pos)	/* 0：将ATIM_BRK2的输入门控成0 */
#define	ATIM_BKCR_BRK2GATE_NO_CR	(0x1U << ATIM_BKCR_BRK2GATE_Pos)	/* 1：不门控 */

#define	ATIM_BKCR_BRK1GATE_Pos	8	/* ATIM_BRK1引脚输入门控信号 */
#define	ATIM_BKCR_BRK1GATE_Msk	(0x1U << ATIM_BKCR_BRK1GATE_Pos)
#define	ATIM_BKCR_BRK1GATE_ZERO	(0x0U << ATIM_BKCR_BRK1GATE_Pos)	/* 0：将ATIM_BRK1的输入门控成0 */
#define	ATIM_BKCR_BRK1GATE_NO_CR	(0x1U << ATIM_BKCR_BRK1GATE_Pos)	/* 1：不门控 */

#define	ATIM_BKCR_BRKF_Pos	4	/* 刹车信号的滤波时钟和长度选择  */
#define	ATIM_BKCR_BRKF_Msk	(0xfU << ATIM_BKCR_BRKF_Pos)
#define	ATIM_BKCR_BRKF_FILT0	(0x0U << ATIM_BKCR_BRKF_Pos)	/* 0000：无滤波 */
#define	ATIM_BKCR_BRKF_FILT1	(0x1U << ATIM_BKCR_BRKF_Pos)	/* 0001：fSAMPLING=fCK_INT, N=2 */
#define	ATIM_BKCR_BRKF_FILT2	(0x2U << ATIM_BKCR_BRKF_Pos)	/* 0010：fSAMPLING=fCK_INT, N=4 */
#define	ATIM_BKCR_BRKF_FILT3	(0x3U << ATIM_BKCR_BRKF_Pos)	/* 0011：fSAMPLING=fCK_INT, N=8 */
#define	ATIM_BKCR_BRKF_FILT4	(0x4U << ATIM_BKCR_BRKF_Pos)	/* 0100：fSAMPLING=fDTS/2, N=6 */
#define	ATIM_BKCR_BRKF_FILT5	(0x5U << ATIM_BKCR_BRKF_Pos)	/* 0101：fSAMPLING=fDTS/2, N=8 */
#define	ATIM_BKCR_BRKF_FILT6	(0x6U << ATIM_BKCR_BRKF_Pos)	/* 0110：fSAMPLING=fDTS/4, N=6 */
#define	ATIM_BKCR_BRKF_FILT7	(0x7U << ATIM_BKCR_BRKF_Pos)	/* 0111：fSAMPLING=fDTS/4, N=8 */
#define	ATIM_BKCR_BRKF_FILT8	(0x8U << ATIM_BKCR_BRKF_Pos)	/* 1000：fSAMPLING=fDTS/8, N=6 */
#define	ATIM_BKCR_BRKF_FILT9	(0x9U << ATIM_BKCR_BRKF_Pos)	/* 1001：fSAMPLING=fDTS/8, N=8 */
#define	ATIM_BKCR_BRKF_FILT10	(0xaU << ATIM_BKCR_BRKF_Pos)	/* 1010：fSAMPLING=fDTS/16, N=5 */
#define	ATIM_BKCR_BRKF_FILT11	(0xbU << ATIM_BKCR_BRKF_Pos)	/* 1011：fSAMPLING=fDTS/16, N=6 */
#define	ATIM_BKCR_BRKF_FILT12	(0xcU << ATIM_BKCR_BRKF_Pos)	/* 1100：fSAMPLING=fDTS/16, N=8 */
#define	ATIM_BKCR_BRKF_FILT13	(0xdU << ATIM_BKCR_BRKF_Pos)	/* 1101：fSAMPLING=fDTS/32, N=5 */
#define	ATIM_BKCR_BRKF_FILT14	(0xeU << ATIM_BKCR_BRKF_Pos)	/* 1110：fSAMPLING=fDTS/32, N=6 */
#define	ATIM_BKCR_BRKF_FILT15	(0xfU << ATIM_BKCR_BRKF_Pos)	/* 1111：fSAMPLING=fDTS/32, N=8 */

#define	ATIM_BKCR_BRKCOMB_Pos	3	/* 刹车组合控制 */
#define	ATIM_BKCR_BRKCOMB_Msk	(0x1U << ATIM_BKCR_BRKCOMB_Pos)
#define	ATIM_BKCR_BRKCOMB_OR	(0x0U << ATIM_BKCR_BRKCOMB_Pos)	/* 0：两路刹车信号相或 */
#define	ATIM_BKCR_BRKCOMB_AND	(0x1U << ATIM_BKCR_BRKCOMB_Pos)	/* 1：两路刹车信号相与 */

#define	ATIM_BKCR_HFDET_BRKEN_Pos	2	/* XTHF停振检测刹车信号使能 */
#define	ATIM_BKCR_HFDET_BRKEN_Msk	(0x1U << ATIM_BKCR_HFDET_BRKEN_Pos)
	/* 0：禁止HFDET刹车信号 */
	/* 1：使能HFDET刹车信号 */

#define	ATIM_BKCR_SVD_BRKEN_Pos	1	/* SVD刹车信号使能 */
#define	ATIM_BKCR_SVD_BRKEN_Msk	(0x1U << ATIM_BKCR_SVD_BRKEN_Pos)
	/* 0：禁止SVD刹车信号 */
	/* 1：使能SVD刹车信号 */

#define	ATIM_BKCR_COMP_BRKEN_Pos	0	/* 比较器输出刹车信号使能 */
#define	ATIM_BKCR_COMP_BRKEN_Msk	(0x1U << ATIM_BKCR_COMP_BRKEN_Pos)
	/* 0：禁止比较器刹车信号 */
	/* 1：使能比较器刹车信号 */
//Macro_End

/* Exported functions --------------------------------------------------------*/ 
extern void ATIM_Deinit(void);

/* Dead time和数字滤波时钟频率分频寄存器 相关函数 */
extern void ATIM_CR1_CKD_Set(uint32_t SetValue);
extern uint32_t ATIM_CR1_CKD_Get(void);

/* ARR预装载使能  相关函数 */
extern void ATIM_CR1_ARPE_Setable(FunState NewState);
extern FunState ATIM_CR1_ARPE_Getable(void);

/* 计数器对齐模式选择 相关函数 */
extern void ATIM_CR1_CMS_Set(uint32_t SetValue);
extern uint32_t ATIM_CR1_CMS_Get(void);

/* 计数方向寄存器 相关函数 */
extern void ATIM_CR1_DIR_Set(uint32_t SetValue);
extern uint32_t ATIM_CR1_DIR_Get(void);

/* 单脉冲输出模式 相关函数 */
extern void ATIM_CR1_OPM_Setable(FunState NewState);
extern FunState ATIM_CR1_OPM_Getable(void);

/* 更新请求选择 相关函数 */
extern void ATIM_CR1_URS_Setable(FunState NewState);
extern FunState ATIM_CR1_URS_Getable(void);

/* 禁止update 相关函数 */
extern void ATIM_CR1_UDIS_Setable(FunState NewState);
extern FunState ATIM_CR1_UDIS_Getable(void);

/* 计数器使能 相关函数 */
extern void ATIM_CR1_CEN_Setable(FunState NewState);
extern FunState ATIM_CR1_CEN_Getable(void);

/* 参考OIS1 相关函数 */
extern void ATIM_CR2_OIS4_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS4_Getable(void);

/* 参考OIS1N 相关函数 */
extern void ATIM_CR2_OIS3N_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS3N_Getable(void);

/* 参考OIS1 相关函数 */
extern void ATIM_CR2_OIS3_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS3_Getable(void);

/* 参考OIS1N 相关函数 */
extern void ATIM_CR2_OIS2N_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS2N_Getable(void);

/* 参考OIS1 相关函数 */
extern void ATIM_CR2_OIS2_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS2_Getable(void);

/* OC1N的输出IDLE状态 相关函数 */
extern void ATIM_CR2_OIS1N_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS1N_Getable(void);

/* OC1的输出IDLE状态 相关函数 */
extern void ATIM_CR2_OIS1_Setable(FunState NewState);
extern FunState ATIM_CR2_OIS1_Getable(void);

/* ATIM输入TI1选择 相关函数 */
extern void ATIM_CR2_TI1S_Set(uint32_t SetValue);
extern uint32_t ATIM_CR2_TI1S_Get(void);

/* 主机模式选择，用于配置主机模式下向从机发送的同步触发信号（TRGO）源 相关函数 */
extern void ATIM_CR2_MMS_Set(uint32_t SetValue);
extern uint32_t ATIM_CR2_MMS_Get(void);

/* 捕捉/比较 DMA选择 相关函数 */
extern void ATIM_CR2_CCDS_Set(uint32_t SetValue);
extern uint32_t ATIM_CR2_CCDS_Get(void);

/* 捕捉/比较控制寄存器更新选择 相关函数 */
extern void ATIM_CR2_CCUS_Set(uint32_t SetValue);
extern uint32_t ATIM_CR2_CCUS_Get(void);
extern void ATIM_CR2_CCPC_Setable(FunState NewState);
extern FunState ATIM_CR2_CCPC_Getable(void);

/* 外部触发信号极性配置 相关函数 */
extern void ATIM_SMCR_ETP_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_ETP_Get(void);

/* 外部时钟使能 相关函数 */
extern void ATIM_SMCR_ECE_Setable(FunState NewState);
extern FunState ATIM_SMCR_ECE_Getable(void);

/* 外部触发信号预分频寄存器,外部触发信号ETRP的频率最多只能是ATIM工作时钟的1/4，当输入信号频率较高时，可以使用预分频 相关函数 */
extern void ATIM_SMCR_ETPS_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_ETPS_Get(void);

/* 外部触发信号滤波时钟和长度选择 相关函数 */
extern void ATIM_SMCR_ETF_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_ETF_Get(void);

/* 主机从机模式选 相关函数 */
extern void ATIM_SMCR_MSM_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_MSM_Get(void);

/* 触发选择，用于选择同步计数器的触发源 相关函数 */
extern void ATIM_SMCR_TS_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_TS_Get(void);

