wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
/* 从机模式选择 相关函数 */
extern void ATIM_SMCR_SMS_Set(uint32_t SetValue);
extern uint32_t ATIM_SMCR_SMS_Get(void);

/* 捕捉比较通道4的DMA模式配置 相关函数 */
extern void ATIM_DIER_CC4BURSTEN_Set(uint32_t SetValue);
extern uint32_t ATIM_DIER_CC4BURSTEN_Get(void);

/* 捕捉比较通道3的DMA模式配置 相关函数 */
extern void ATIM_DIER_CC3BURSTEN_Set(uint32_t SetValue);
extern uint32_t ATIM_DIER_CC3BURSTEN_Get(void);

/* 捕捉比较通道2的DMA模式配置 相关函数 */
extern void ATIM_DIER_CC2BURSTEN_Set(uint32_t SetValue);
extern uint32_t ATIM_DIER_CC2BURSTEN_Get(void);

/* 捕捉比较通道1的DMA模式配置 相关函数 */
extern void ATIM_DIER_CC1BURSTEN_Set(uint32_t SetValue);
extern uint32_t ATIM_DIER_CC1BURSTEN_Get(void);

/* 外部触发DMA请求使能 相关函数 */
extern void ATIM_DIER_TDE_Setable(FunState NewState);
extern FunState ATIM_DIER_TDE_Getable(void);

/* COM事件DMA请求使能 相关函数 */
extern void ATIM_DIER_COMDE_Setable(FunState NewState);
extern FunState ATIM_DIER_COMDE_Getable(void);

/* 捕捉比较通道4的DMA请求使能 相关函数 */
extern void ATIM_DIER_CC4DE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC4DE_Getable(void);

/* 捕捉比较通道3的DMA请求使能 相关函数 */
extern void ATIM_DIER_CC3DE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC3DE_Getable(void);

/* 捕捉比较通道2的DMA请求使能 相关函数 */
extern void ATIM_DIER_CC2DE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC2DE_Getable(void);

/* 捕捉比较通道1的DMA请求使能 相关函数 */
extern void ATIM_DIER_CC1DE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC1DE_Getable(void);

/* 更新事件DMA请求使能  相关函数 */
extern void ATIM_DIER_UDE_Setable(FunState NewState);
extern FunState ATIM_DIER_UDE_Getable(void);

/* 刹车事件中断使能 相关函数 */
extern void ATIM_DIER_BIE_Setable(FunState NewState);
extern FunState ATIM_DIER_BIE_Getable(void);

/* 触发事件中断使能 相关函数 */
extern void ATIM_DIER_TIE_Setable(FunState NewState);
extern FunState ATIM_DIER_TIE_Getable(void);

/* COM事件中断使能 相关函数 */
extern void ATIM_DIER_COMIE_Setable(FunState NewState);
extern FunState ATIM_DIER_COMIE_Getable(void);

/* 捕捉/比较通道4中断使能 相关函数 */
extern void ATIM_DIER_CC4IE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC4IE_Getable(void);

/* 捕捉/比较通道3中断使能 相关函数 */
extern void ATIM_DIER_CC3IE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC3IE_Getable(void);

/* 捕捉/比较通道2中断使能 相关函数 */
extern void ATIM_DIER_CC2IE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC2IE_Getable(void);

/* 捕捉/比较通道1中断使能 相关函数 */
extern void ATIM_DIER_CC1IE_Setable(FunState NewState);
extern FunState ATIM_DIER_CC1IE_Getable(void);

/* 更新事件中断使能 相关函数 */
extern void ATIM_DIER_UIE_Setable(FunState NewState);
extern FunState ATIM_DIER_UIE_Getable(void);

/* 捕捉/比较通道4的Overcapture中断 相关函数 */
extern void ATIM_ISR_CC4OF_Clr(void);
extern FlagStatus ATIM_ISR_CC4OF_Chk(void);

/* 捕捉/比较通道3的Overcapture中断 相关函数 */
extern void ATIM_ISR_CC3OF_Clr(void);
extern FlagStatus ATIM_ISR_CC3OF_Chk(void);

/* 捕捉/比较通道2的Overcapture中断 相关函数 */
extern void ATIM_ISR_CC2OF_Clr(void);
extern FlagStatus ATIM_ISR_CC2OF_Chk(void);

/* 捕捉/比较通道1的Overcapture中断，此寄存器仅在对应通道设置为输入捕捉模式的情况下有效。硬件置位，软件写1清零 相关函数 */
extern void ATIM_ISR_CC1OF_Clr(void);
extern FlagStatus ATIM_ISR_CC1OF_Chk(void);

/* 刹车事件中断标志，硬件置位，软件写1清零 相关函数 */
extern void ATIM_ISR_BIF_Clr(void);
extern FlagStatus ATIM_ISR_BIF_Chk(void);

/* 触发事件中断标志，硬件置位，软件写1清零 相关函数 */
extern void ATIM_ISR_TIF_Clr(void);
extern FlagStatus ATIM_ISR_TIF_Chk(void);

/* COM事件中断标志，硬件置位，软件写1清零 相关函数 */
extern void ATIM_ISR_COMIF_Clr(void);
extern FlagStatus ATIM_ISR_COMIF_Chk(void);

/* 捕捉/比较通道4中断标志，参考CC1IF 相关函数 */
extern void ATIM_ISR_CC4IF_Clr(void);
extern FlagStatus ATIM_ISR_CC4IF_Chk(void);

/* 捕捉/比较通道3中断标志，参考CC1IF 相关函数 */
extern void ATIM_ISR_CC3IF_Clr(void);
extern FlagStatus ATIM_ISR_CC3IF_Chk(void);

/* 捕捉/比较通道2中断标志，参考CC1IF 相关函数 */
extern void ATIM_ISR_CC2IF_Clr(void);
extern FlagStatus ATIM_ISR_CC2IF_Chk(void);

/* 捕捉/比较通道1中断标志，如果CC1通道配置为输出：CC1IF在计数值等于比较值时置位，软件写1清零。
如果CC1通道配置为输入：发生捕捉事件时置位，软件写1清零，或者软件读ATIM_CCR1自动清零 相关函数 */
extern void ATIM_ISR_CC1IF_Clr(void);
extern FlagStatus ATIM_ISR_CC1IF_Chk(void);

/* 更新事件中断标志，硬件置位，软件写1清零 相关函数 */
extern void ATIM_ISR_UIF_Clr(void);
extern FlagStatus ATIM_ISR_UIF_Chk(void);

/* 软件刹车，软件置位此寄存器产生刹车事件，硬件自动清零 相关函数 */
extern void ATIM_EGR_BG_Setable(FunState NewState);

/* 软件触发，软件置位此寄存器产生触发事件，硬件自动清零 相关函数 */
extern void ATIM_EGR_TIF_Setable(FunState NewState);

/* 软件COM事件，硬件置位，软件写1清零 相关函数 */
extern void ATIM_EGR_COMG_Setable(FunState NewState);

/* 捕捉/比较通道4软件触发，参考CC1G 相关函数 */
extern void ATIM_EGR_CC4G_Setable(FunState NewState);

/* 捕捉/比较通道3软件触发，参考CC1G 相关函数 */
extern void ATIM_EGR_CC3G_Setable(FunState NewState);

/* 捕捉/比较通道2软件触发，参考CC1G 相关函数 */
extern void ATIM_EGR_CC2G_Setable(FunState NewState);

/* 捕捉/比较通道1软件触发 相关函数 */
extern void ATIM_EGR_CC1G_Setable(FunState NewState);

/* 软件Update事件，软件置位此寄存器产生Update事件，硬件自动清零 相关函数 */
extern void ATIM_EGR_UG_Setable(FunState NewState);

/* 输出比较2清零使能，参考OC1CE 相关函数 */
extern void ATIM_CCMR1_OC2CE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC2CE_Getable(void);

/* 输出比较2模式配置，参考OC1M 相关函数 */
extern void ATIM_CCMR1_OC2M_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_OC2M_Get(void);

/* 输出比较2预装载使能，参考OC1PE 相关函数 */
extern void ATIM_CCMR1_OC2PE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC2PE_Getable(void);

/* 输出比较2快速使能，参考OC1FE 相关函数 */
extern void ATIM_CCMR1_OC2FE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC2FE_Getable(void);

/* 捕捉/比较2通道选择 相关函数 */
extern void ATIM_CCMR1_CC2S_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_CC2S_Get(void);

/* 输出比较1清零使能 相关函数 */
extern void ATIM_CCMR1_OC1CE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC1CE_Getable(void);

/* 输出比较1模式配置，此寄存器定义OC1REF信号的行为 相关函数 */
extern void ATIM_CCMR1_OC1M_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_OC1M_Get(void);

/* 输出比较1预装载使能 相关函数 */
extern void ATIM_CCMR1_OC1PE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC1PE_Getable(void);

/* 输出比较1快速使能 相关函数 */
extern void ATIM_CCMR1_OC1FE_Setable(FunState NewState);
extern FunState ATIM_CCMR1_OC1FE_Getable(void);

/* 捕捉/比较1通道选择 相关函数 */
extern void ATIM_CCMR1_CC1S_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_CC1S_Get(void);

/* 输入捕捉2滤波 相关函数 */
extern void ATIM_CCMR1_IC2F_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_IC2F_Get(void);

/* 输入捕捉2预分频 相关函数 */
extern void ATIM_CCMR1_IC2PSC_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_IC2PSC_Get(void);

/* 输入捕捉1滤波 相关函数 */
extern void ATIM_CCMR1_IC1F_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_IC1F_Get(void);

/* 输入捕捉1预分频 相关函数 */
extern void ATIM_CCMR1_IC1PSC_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR1_IC1PSC_Get(void);

/* 输出比较4清零使能，参考OC1CE 相关函数 */
extern void ATIM_CCMR2_OC4CE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC4CE_Getable(void);
extern void ATIM_CCMR2_OC4M_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_OC4M_Get(void);

