wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.h
/* 输出比较4预装载使能，参考OC1PE 相关函数 */
extern void ATIM_CCMR2_OC4PE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC4PE_Getable(void);

/* 输出比较4快速使能，参考OC1FE 相关函数 */
extern void ATIM_CCMR2_OC4FE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC4FE_Getable(void);

/* 捕捉/比较4通道选择 相关函数 */
extern void ATIM_CCMR2_CC4S_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_CC4S_Get(void);

/* 输出比较1清零使能 相关函数 */
extern void ATIM_CCMR2_OC3CE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC3CE_Getable(void);

/* 输出比较3模式配置，此寄存器定义OC3REF信号的行为 相关函数 */
extern void ATIM_CCMR2_OC3M_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_OC3M_Get(void);

/* 输出比较3预装载使能 相关函数 */
extern void ATIM_CCMR2_OC3PE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC3PE_Getable(void);

/* 输出比较3快速使能 相关函数 */
extern void ATIM_CCMR2_OC3FE_Setable(FunState NewState);
extern FunState ATIM_CCMR2_OC3FE_Getable(void);

/* 捕捉/比较3通道选择 相关函数 */
extern void ATIM_CCMR2_CC3S_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_CC3S_Get(void);

/* 输入捕捉4滤波 相关函数 */
extern void ATIM_CCMR2_IC4F_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_IC4F_Get(void);

/* 输入捕捉4预分频 相关函数 */
extern void ATIM_CCMR2_IC4PSC_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_IC4PSC_Get(void);

/* 输入捕捉3滤波 相关函数 */
extern void ATIM_CCMR2_IC3F_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_IC3F_Get(void);

/* 输入捕捉3预分频 相关函数 */
extern void ATIM_CCMR2_IC3PSC_Set(uint32_t SetValue);
extern uint32_t ATIM_CCMR2_IC3PSC_Get(void);

/* 捕捉/比较4输出极性，参考CC1P 相关函数 */
extern void ATIM_CCER_CC4P_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC4P_Get(void);

/* 捕捉/比较4输出使能，参考CC1E 相关函数 */
extern void ATIM_CCER_CC4E_Setable(FunState NewState);
extern FunState ATIM_CCER_CC4E_Getable(void);

/* 捕捉/比较3互补输出极性，参考CC1NP 相关函数 */
extern void ATIM_CCER_CC3NP_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC3NP_Get(void);

/* 捕捉/比较3互补输出使能，参考CC1NE 相关函数 */
extern void ATIM_CCER_CC3NE_Setable(FunState NewState);
extern FunState ATIM_CCER_CC3NE_Getable(void);

/* 捕捉/比较3输出极性，参考CC1P 相关函数 */
extern void ATIM_CCER_CC3P_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC3P_Get(void);

/* 捕捉/比较3输出使能，参考CC1E 相关函数 */
extern void ATIM_CCER_CC3E_Setable(FunState NewState);
extern FunState ATIM_CCER_CC3E_Getable(void);

/* 捕捉/比较2互补输出极性，参考CC1NP 相关函数 */
extern void ATIM_CCER_CC2NP_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC2NP_Get(void);

/* 捕捉/比较2互补输出使能，参考CC1NE 相关函数 */
extern void ATIM_CCER_CC2NE_Setable(FunState NewState);
extern FunState ATIM_CCER_CC2NE_Getable(void);

/* 捕捉/比较2输出极性，参考CC1P 相关函数 */
extern void ATIM_CCER_CC2P_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC2P_Get(void);

/* 捕捉/比较2输出使能，参考CC1E 相关函数 */
extern void ATIM_CCER_CC2E_Setable(FunState NewState);
extern FunState ATIM_CCER_CC2E_Getable(void);

/* 捕捉/比较1互补输出极性 相关函数 */
extern void ATIM_CCER_CC1NP_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC1NP_Get(void);

/* 捕捉/比较1互补输出使能 相关函数 */
extern void ATIM_CCER_CC1NE_Setable(FunState NewState);
extern FunState ATIM_CCER_CC1NE_Getable(void);

/* 捕捉/比较1输出极性 (CC1 Polarity)
CC1通道配置为输出时
0：OC1高电平active
1：OC1低电平active
CC1通道配置为输入时
0：非取反模式–捕捉在IC1的上升沿进行
1：取反模式–捕捉在IC1的下降沿进行 相关函数 */
extern void ATIM_CCER_CC1P_Set(uint32_t SetValue);
extern uint32_t ATIM_CCER_CC1P_Get(void);

/* 捕捉/比较1输出使能 (CC1 Enable)
CC1通道配置为输出时
0：OC1不active
1：OC1 active
CC1通道配置为输入时
0：关闭捕捉功能
1：使能捕捉功能 相关函数 */
extern void ATIM_CCER_CC1E_Setable(FunState NewState);
extern FunState ATIM_CCER_CC1E_Getable(void);

/* 计数器值 相关函数 */
extern void ATIM_CNT_Write(uint32_t SetValue);
extern uint32_t ATIM_CNT_Read(void);

/* 计数器时钟预分频值
fCK_CNT=fCK_PSC/(PSC[15:0]+1)
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 相关函数 */
extern void ATIM_PSC_Write(uint32_t SetValue);
extern uint32_t ATIM_PSC_Read(void);

/* 计数溢出时的自动重载值 
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 相关函数 */
extern void ATIM_ARR_Write(uint32_t SetValue);
extern uint32_t ATIM_ARR_Read(void);

/* 重复计数值  相关函数 */
extern void ATIM_RCR_Write(uint32_t SetValue);
extern uint32_t ATIM_RCR_Read(void);

/* 捕捉/比较通道1寄存器 
如果通道1配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC1输出
如果通道1配置为输入：
CCR1保存最近一次输入捕捉事件发生时的计数器值，此时CCR1为只读 相关函数 */
extern void ATIM_CCR1_Write(uint32_t SetValue);
extern uint32_t ATIM_CCR1_Read(void);

/* 捕捉/比较通道2寄存器 
如果通道2配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC2输出
如果通道2配置为输入：
CCR2保存最近一次输入捕捉事件发生时的计数器值，此时CCR2为只读 相关函数 */
extern void ATIM_CCR2_Write(uint32_t SetValue);
extern uint32_t ATIM_CCR2_Read(void);

/* 捕捉/比较通道3寄存器 
如果通道3配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC3输出
如果通道3配置为输入：
CCR3保存最近一次输入捕捉事件发生时的计数器值，此时CCR3为只读 相关函数 */
extern void ATIM_CCR3_Write(uint32_t SetValue);
extern uint32_t ATIM_CCR3_Read(void);

/* 捕捉/比较通道4寄存器 
如果通道4配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC4输出
如果通道4配置为输入：
CCR4保存最近一次输入捕捉事件发生时的计数器值，此时CCR4为只读 相关函数 */
extern void ATIM_CCR4_Write(uint32_t SetValue);
extern uint32_t ATIM_CCR4_Read(void);

/* 输出使能主控 相关函数 */
extern void ATIM_BDTR_MOE_Setable(FunState NewState);
extern FunState ATIM_BDTR_MOE_Getable(void);

/* 自动输出使能 相关函数 */
extern void ATIM_BDTR_AOE_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_AOE_Get(void);
extern void ATIM_BDTR_BKP_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_BKP_Get(void);
extern void ATIM_BDTR_BKE_Setable(FunState NewState);
extern FunState ATIM_BDTR_BKE_Getable(void);
extern void ATIM_BDTR_OSSR_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_OSSR_Get(void);
extern void ATIM_BDTR_OSSI_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_OSSI_Get(void);

/* 寄存器写保护配置 相关函数 */
extern void ATIM_BDTR_LOCK_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_LOCK_Get(void);

/* 死区时间插入，用于配置互补输出插入的死区时间长度 相关函数 */
extern void ATIM_BDTR_DTG_Set(uint32_t SetValue);
extern uint32_t ATIM_BDTR_DTG_Get(void);

/* DMA Burst长度 相关函数 */
extern void ATIM_DCR_DBL_Set(uint32_t SetValue);
extern uint32_t ATIM_DCR_DBL_Get(void);

/* DMA基地址，定义指向寄存器的偏移地址 相关函数 */
extern void ATIM_DCR_DBA_Set(uint32_t SetValue);
extern uint32_t ATIM_DCR_DBA_Get(void);

/* DMA burst访问寄存器
在使用DMA burst传输时，将DMA通道外设地址设置为ATIM_DMAR，ATIM会根据DBL的值产生多次DMA请求 相关函数 */
extern void ATIM_DMAR_Write(uint32_t SetValue);
extern uint32_t ATIM_DMAR_Read(void);

/* ATIM_BRK2引脚输入门控信号 相关函数 */
extern void ATIM_BKCR_BRK2GATE_Set(uint32_t SetValue);
extern uint32_t ATIM_BKCR_BRK2GATE_Get(void);

/* ATIM_BRK1引脚输入门控信号 相关函数 */
extern void ATIM_BKCR_BRK1GATE_Set(uint32_t SetValue);
extern uint32_t ATIM_BKCR_BRK1GATE_Get(void);

/* 刹车信号的滤波时钟和长度选择  相关函数 */
extern void ATIM_BKCR_BRKF_Set(uint32_t SetValue);
extern uint32_t ATIM_BKCR_BRKF_Get(void);

/* 刹车组合控制 相关函数 */
extern void ATIM_BKCR_BRKCOMB_Set(uint32_t SetValue);
extern uint32_t ATIM_BKCR_BRKCOMB_Get(void);

/* XTHF停振检测刹车信号使能 相关函数 */
extern void ATIM_BKCR_HFDET_BRKEN_Setable(FunState NewState);
extern FunState ATIM_BKCR_HFDET_BRKEN_Getable(void);

/* SVD刹车信号使能 相关函数 */
extern void ATIM_BKCR_SVD_BRKEN_Setable(FunState NewState);
extern FunState ATIM_BKCR_SVD_BRKEN_Getable(void);

/* 比较器输出刹车信号使能 相关函数 */
extern void ATIM_BKCR_COMP_BRKEN_Setable(FunState NewState);
extern FunState ATIM_BKCR_COMP_BRKEN_Getable(void);
 
extern void ATIM_TimeBaseInit(TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
extern void ATIM_ClearITPendingBit(uint32_t TIM_IT);
extern void ATIM_ITConfig(uint32_t TIM_IT, FunState NewState);
extern ITStatus ATIM_GetITStatus(uint32_t TIM_IT);
extern void ATIM_Cmd(FunState NewState);
#ifdef __cplusplus
}
#endif

#endif /* __FM33L0XX_ATIM_H */



/************************ (C) COPYRIGHT FMSHelectronics *****END OF FILE****/
